import json

data = {
    "Имя":"Вячеслав",
    "Фамилия":"Бычков",
    "Отчество":"Константинович",
    "Адрес": {
        "Улица":"Мечникова 79а",
        "Город":"Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контактные данные": {
        "Номер телефона":"+7 928 633 04 28",
        "Страница vk.com":"vk.com/slavabyk",
        "Страница instagram":"@slava_byk"
    },
    "Примечания":"Студен ВПИ11, проживает в общежитии №3, комната 406"
},{
    "Имя":"Данил",
    "Фамилия":"Лазоренко",
    "Отчество":"Евгеньевич",
    "Адрес": {
        "Улица":"Мечникова 79а",
        "Город":"Ростов-на-Дону",
        "Индекс": 344000
    },
    "Контактные данные": {
        "Номер телефона":"+7 967 300 24 84",
        "Страница vk.com":"vk.com/theythinkimgay",
        "Страница instagram":"@ss_rdt"
    },
    "Примечания":"Студент ВПИ11, проживает в общежитии №3, комната 539"
    }
with open('result1.json', 'w') as outfile:
    json.dump(data, outfile)